yasserabdoulaye92/Projet_DEEP/drivers/bsp/tft_ili9341/stm32g4_ili9341.c
/**
 *******************************************************************************
 * @file	stm32g4_ili9341.c
 * @author	vchav
 * @date	May 22, 2024
 * @brief	Ce module permet d'utiliser l'écran TFT ili9341. Il est inspiré des
 * 			travaux de Tilen Majerle
 *******************************************************************************
 * @verbatim
 * |----------------------------------------------------------------------
 * | Copyright (C) Tilen Majerle, 2014
 * | 
 * | This program is free software: you can redistribute it and/or modify
 * | it under the terms of the GNU General Public License as published by
 * | the Free Software Foundation, either version 3 of the License, or
 * | any later version.
 * |  
 * | This program is distributed in the hope that it will be useful,
 * | but WITHOUT ANY WARRANTY; without even the implied warranty of
 * | MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * | GNU General Public License for more details.
 * | 
 * | You should have received a copy of the GNU General Public License
 * | along with this program.  If not, see <http://www.gnu.org/licenses/>.
 * |----------------------------------------------------------------------
 * @endverbatim
 */

#include "config.h"
#if USE_ILI9341
#include <stdarg.h>
#include <stdio.h>
#include <TFT_ili9341/stm32g4_ili9341.h>

#include "stm32g4xx_hal.h"
#include "stm32g4_spi.h"
#include "stm32g4_utils.h"
#include "stm32g4_gpio.h"
#include "stm32g4_fonts.h"
/*
 * Cette bibliothèque contient les fonctions nécessaires pour utiliser l'écran TFT ILI9341 avec un STM32G4.
 *
 * Le module utilise le bus SPI et les broches sont imposées (l'alimentation adéquate et la GND doivent également être choisies) :
 *
 *  CS   : PA4 : Sélection de puce pour SPI
 *  RESET: PB3  : Broche utilisée pour réinitialiser l'écran
 *  D/C  : PA8  : Broche utilisée pour sélectionner les données ou les commandes
 *  SDI  : PA7  : Entrée depuis le maître SPI (MOSI)
 *  SCK  : PA5  : Horloge SPI
 *  LED  : +3,3V:
 *  SDO  : PA6  : Sortie de l'écran vers SPI (MISO)
 *
 *  Comment utiliser cette bibliothèque :
 *
 *  - Assurez-vous que USE_SCREEN_TFT_ILI9341 dans config.h est correctement défini à 1
 *  - Initialisez la bibliothèque (fonction d'initialisation)
 *  - Utilisez la fonction souhaitée pour dessiner sur l'écran
 *
 */

#define CUSTOM_FAST_MODE		1 	//Optimisation des fonctions d'envoi de données en SPI (évite les appels de fonctions répétitifs dans les boucles serrées)

/* Pin definitions */
#define ILI9341_RST_SET()			HAL_GPIO_WritePin(ILI9341_RST_PORT,ILI9341_RST_PIN, 1)
#define ILI9341_RST_RESET()			HAL_GPIO_WritePin(ILI9341_RST_PORT,ILI9341_RST_PIN, 0)
#define ILI9341_CS_SET()			HAL_GPIO_WritePin(ILI9341_CS_PORT, ILI9341_CS_PIN, 1)
#define ILI9341_CS_RESET()			HAL_GPIO_WritePin(ILI9341_CS_PORT, ILI9341_CS_PIN, 0)
#define ILI9341_WRX_SET()			HAL_GPIO_WritePin(ILI9341_WRX_PORT, ILI9341_WRX_PIN, 1)
#define ILI9341_WRX_RESET()			HAL_GPIO_WritePin(ILI9341_WRX_PORT, ILI9341_WRX_PIN, 0)

/* Private defines */
/* Adresses des registres */
#define ILI9341_RESET				0x01
#define ILI9341_SLEEP_OUT			0x11
#define ILI9341_GAMMA				0x26
#define ILI9341_DISPLAY_OFF			0x28
#define ILI9341_DISPLAY_ON			0x29
#define ILI9341_COLUMN_ADDR			0x2A
#define ILI9341_PAGE_ADDR			0x2B
#define ILI9341_GRAM				0x2C
#define ILI9341_CMD_MEMORY_READ		0x2E
#define ILI9341_MAC					0x36
#define ILI9341_PIXEL_FORMAT		0x3A
#define ILI9341_WDB					0x51
#define ILI9341_WCD					0x53
#define ILI9341_RGB_INTERFACE		0xB0
#define ILI9341_FRC					0xB1
#define ILI9341_BPC					0xB5
#define ILI9341_DFC					0xB6
#define ILI9341_POWER1				0xC0
#define ILI9341_POWER2				0xC1
#define ILI9341_VCOM1				0xC5
#define ILI9341_VCOM2				0xC7
#define ILI9341_POWERA				0xCB
#define ILI9341_POWERB				0xCF
#define ILI9341_PGAMMA				0xE0
#define ILI9341_NGAMMA				0xE1
#define ILI9341_DTCA				0xE8
#define ILI9341_DTCB				0xEA
#define ILI9341_POWER_SEQ			0xED
#define ILI9341_3GAMMA_EN			0xF2
#define ILI9341_INTERFACE			0xF6
#define ILI9341_PRC					0xF7

/* Pin functions */
uint16_t ILI9341_x;
uint16_t ILI9341_y;
ILI931_Options_t ILI9341_Opts;
uint8_t ILI9341_INT_CalledFromPuts = 0;

/* Private functions */
void ILI9341_InitLCD(void);
void ILI9341_SendData(uint8_t data);
void ILI9341_ReadDatas(uint8_t command_to_write, uint8_t * datas, uint8_t nb_to_read);
void ILI9341_SendCommand(uint8_t data);
void ILI9341_Delay(volatile unsigned int delay);
void ILI9341_SetCursorPosition(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2);
void ILI9341_INT_Fill(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t color);


/**
 * @brief 	Cette fonction à pour but de vous aider à appréhender les fonctionnalités de ce module logiciel.
 * 			Cette fonction n'est pas blocante. Elle affiche simplement quelques éléments sur l'écran.
 * @pre Il est conseillé de "débloquer" au moins une police de caractères (USE_FONT7x10,...) pour voir l'affichage de texte sur l'écran
 */
void ILI9341_demo(void)
{
	ILI9341_Init();
	ILI9341_Rotate(ILI9341_Orientation_Landscape_2);
 	ILI9341_DisplayOff();
	ILI9341_DisplayOn();
	ILI9341_Fill(ILI9341_COLOR_WHITE);
	ILI9341_DrawCircle(20,20,5,ILI9341_COLOR_BLUE);
	ILI9341_DrawLine(20,20,100,20,ILI9341_COLOR_RED);
	ILI9341_DrawLine(20,20,20,100,ILI9341_COLOR_RED);

	#if USE_FONT7x10
		ILI9341_Putc(110,11,'x',&Font_7x10,ILI9341_COLOR_BLUE,ILI9341_COLOR_WHITE);
		ILI9341_Putc(15,110,'y',&Font_7x10,ILI9341_COLOR_BLUE,ILI9341_COLOR_WHITE);
		ILI9341_Puts(25,200, "chaine 7x10", &Font_7x10, ILI9341_COLOR_BROWN, ILI9341_COLOR_WHITE);
		ILI9341_printf(25, 240, &Font_7x10, ILI9341_COLOR_BROWN, ILI9341_COLOR_WHITE, "%d", 20);
	#endif
	#if USE_FONT11x18
		ILI9341_Puts(25,225, "chaine 11x18", &Font_11x18, ILI9341_COLOR_BROWN, ILI9341_COLOR_WHITE);
	#endif
	#if USE_FONT16x26
		ILI9341_Puts(25,250, "chaine 16x26", &Font_16x26, ILI9341_COLOR_BROWN, ILI9341_COLOR_WHITE);
	#endif

}

/**
 * @brief  Cette fonction configure les broches nécessaires pour le contrôle
 *         de l'afficheur ILI9341, initialise le périphérique SPI utilisé pour
 *         communiquer avec l'afficheur et règle l'orientation par défaut de
 *         l'écran LCD. Elle remplit également l'écran avec une couleur blanche.
 */
void ILI9341_Init(void)
{
	/* Init WRX pin */
	BSP_GPIO_pin_config(ILI9341_WRX_PORT, ILI9341_WRX_PIN, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_MEDIUM, GPIO_NO_AF);
	
	/* Init CS pin */
	BSP_GPIO_pin_config(ILI9341_CS_PORT,ILI9341_CS_PIN, GPIO_MODE_OUTPUT_PP,GPIO_NOPULL,GPIO_SPEED_FREQ_MEDIUM, GPIO_NO_AF);
	
	#ifdef PIN_CS_TOUCH    /* Init CS Touchpad pin */
		BSP_GPIO_pin_config(PIN_CS_TOUCH, GPIO_MODE_OUTPUT_PP,GPIO_PULLUP,GPIO_SPEED_FREQ_MEDIUM, GPIO_NO_AF);
	#endif

