yasserabdoulaye92/Projet_DEEP/drivers/bsp/tft_ili9341/stm32g4_ili9341.c
	/* Init RST pin */
	BSP_GPIO_pin_config(ILI9341_RST_PORT,ILI9341_RST_PIN, GPIO_MODE_OUTPUT_PP,GPIO_PULLUP,GPIO_SPEED_FREQ_LOW, GPIO_NO_AF);


	/* CS high */
	ILI9341_CS_SET();
	
	/* Init SPI */
	BSP_SPI_Init(ILI9341_SPI, FULL_DUPLEX, MASTER, SPI_BAUDRATEPRESCALER_2);
	
	/* Init DMA for SPI */
	//SPI_DMA_Init(ILI9341_SPI);
	
	/* Init LCD */
	ILI9341_InitLCD();
	
	/* Set default settings */
	ILI9341_x = ILI9341_y = 0;
	ILI9341_Rotate(ILI9341_Orientation_Landscape_2);	//Fonction pour modifier l'orientation de l'écran
	
	/* Fill with white color */
	ILI9341_Fill(ILI9341_COLOR_WHITE);
}

/**
 * @brief init function for XPT2046 lib
 */
void ILI9341_setConfig(void){
	BSP_SPI_setBaudRate(ILI9341_SPI, SPI_BAUDRATEPRESCALER_2);
}

/**
 * @brief  Initialise le LCD ILI9341
 */
void ILI9341_InitLCD(void) {
	/* Force reset */
	ILI9341_RST_RESET();
	HAL_Delay(20);
	ILI9341_RST_SET();
	
	/* Delay for RST response */
	HAL_Delay(20);
	
	/* Software reset */
	ILI9341_SendCommand(ILI9341_RESET);
	HAL_Delay(50);
	
	// Power control A
	ILI9341_SendCommand(ILI9341_POWERA);
	ILI9341_SendData(0x39);
	ILI9341_SendData(0x2C);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x34);
	ILI9341_SendData(0x02);

	// Power control B
	ILI9341_SendCommand(ILI9341_POWERB);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0xC1);
	ILI9341_SendData(0x30);

	// Driver timing control A
	ILI9341_SendCommand(ILI9341_DTCA);
	ILI9341_SendData(0x85);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x78);

	// Driver timing control B
	ILI9341_SendCommand(ILI9341_DTCB);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x00);

	// Power on sequence control
	ILI9341_SendCommand(ILI9341_POWER_SEQ);
	ILI9341_SendData(0x64);
	ILI9341_SendData(0x03);
	ILI9341_SendData(0x12);
	ILI9341_SendData(0x81);

	// Pump ratio control
	ILI9341_SendCommand(ILI9341_PRC);
	ILI9341_SendData(0x20);

	// Power control 1
	ILI9341_SendCommand(ILI9341_POWER1);
	ILI9341_SendData(0x23);

	// Power control 2
	ILI9341_SendCommand(ILI9341_POWER2);
	ILI9341_SendData(0x10);

	// VCOM control 1
	ILI9341_SendCommand(ILI9341_VCOM1);
	ILI9341_SendData(0x3E);
	ILI9341_SendData(0x28);

	// VCOM control 2
	ILI9341_SendCommand(ILI9341_VCOM2);
	ILI9341_SendData(0x86);

	// Memory access control
	ILI9341_SendCommand(ILI9341_MAC);
	ILI9341_SendData(0x48);

	// Pixel format set
	ILI9341_SendCommand(ILI9341_PIXEL_FORMAT);
	ILI9341_SendData(0x55);

	// Frame rate control
	ILI9341_SendCommand(ILI9341_FRC);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x18);

	// Display function control
	ILI9341_SendCommand(ILI9341_DFC);
	ILI9341_SendData(0x08);
	ILI9341_SendData(0x82);
	ILI9341_SendData(0x27);

	// 3Gamma function disable
	ILI9341_SendCommand(ILI9341_3GAMMA_EN);
	ILI9341_SendData(0x00);


	ILI9341_SendCommand(ILI9341_COLUMN_ADDR);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0xEF);

	ILI9341_SendCommand(ILI9341_PAGE_ADDR);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x01);
	ILI9341_SendData(0x3F);

	// Gamma curve selected
	ILI9341_SendCommand(ILI9341_GAMMA);
	ILI9341_SendData(0x01);

	// Set positive gamma
	ILI9341_SendCommand(ILI9341_PGAMMA);
	ILI9341_SendData(0x0F);
	ILI9341_SendData(0x31);
	ILI9341_SendData(0x2B);
	ILI9341_SendData(0x0C);
	ILI9341_SendData(0x0E);
	ILI9341_SendData(0x08);
	ILI9341_SendData(0x4E);
	ILI9341_SendData(0xF1);
	ILI9341_SendData(0x37);
	ILI9341_SendData(0x07);
	ILI9341_SendData(0x10);
	ILI9341_SendData(0x03);
	ILI9341_SendData(0x0E);
	ILI9341_SendData(0x09);
	ILI9341_SendData(0x00);

	// Set negative gama
	ILI9341_SendCommand(ILI9341_NGAMMA);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x0E);
	ILI9341_SendData(0x14);
	ILI9341_SendData(0x03);
	ILI9341_SendData(0x11);
	ILI9341_SendData(0x07);
	ILI9341_SendData(0x31);
	ILI9341_SendData(0xC1);
	ILI9341_SendData(0x48);
	ILI9341_SendData(0x08);
	ILI9341_SendData(0x0F);
	ILI9341_SendData(0x0C);
	ILI9341_SendData(0x31);
	ILI9341_SendData(0x36);
	ILI9341_SendData(0x0F);

	ILI9341_SendCommand(ILI9341_SLEEP_OUT);

	HAL_Delay(10);

	ILI9341_SendCommand(ILI9341_DISPLAY_ON);
	ILI9341_SendCommand(ILI9341_GRAM);
}

/**
 * @brief   Active l'écran LCD
 * @note    Après une initialisaton, l'écran est déjà allumé. Vous n'avez donc pas besoins de remettre cette fonction
 */
void ILI9341_DisplayOn(void) {
	ILI9341_SendCommand(ILI9341_DISPLAY_ON);
}

/**
 * @brief   Désactive/Eteint l'écran
 */
void ILI9341_DisplayOff(void) {
	ILI9341_SendCommand(ILI9341_DISPLAY_OFF);
}

static inline void fast_custom_spi_write_byte(uint8_t data)
{
	ILI9341_SPI->CR1 |= SPI_CR1_SPE; // Enable SPI

    // 1️ Attendre que le TX soit prêt
    while ((ILI9341_SPI->SR & SPI_SR_TXE) == 0);

    // 2️ Envoyer le byte
    *((__IO uint8_t *)&ILI9341_SPI->DR) = data;

    // 3️ Attendre que le transfert soit terminé
    while ((ILI9341_SPI->SR & SPI_SR_RXNE) == 0);

    // 4️ (optionnel) Lire le DR pour vider la réception si en full-duplex
    (void)ILI9341_SPI->DR;

    // 5️ Attendre que SPI ne soit plus occupé (fin physique du shift)
    while ((ILI9341_SPI->SR & SPI_SR_BSY) != 0);
}

/**
 * @brief  Envoie la commande souhaitée sur le bus SPI
 */
void ILI9341_SendCommand(uint8_t data) {
	ILI9341_WRX_RESET();
	ILI9341_CS_RESET();
#if CUSTOM_FAST_MODE
	fast_custom_spi_write_byte(data);
#else
	BSP_SPI_WriteNoRegister(ILI9341_SPI, data);
#endif
	ILI9341_CS_SET();
}

/**
 * @brief  Envoie la donnée désirée sur le bus SPI
 */
void ILI9341_SendData(uint8_t data) {
	//TODO Isnt that redundant
	ILI9341_WRX_SET();
	ILI9341_CS_RESET();
#if CUSTOM_FAST_MODE
	fast_custom_spi_write_byte(data);
#else
	BSP_SPI_WriteNoRegister(ILI9341_SPI, data);
#endif
	ILI9341_CS_SET();
}


void ILI9341_ReadDatas(uint8_t command_to_write, uint8_t * datas, uint8_t nb_to_read) {
	ILI9341_CS_RESET();
	ILI9341_WRX_RESET();
	BSP_SPI_WriteNoRegister(ILI9341_SPI, command_to_write);
	ILI9341_WRX_SET();
	BSP_SPI_ReadMultiNoRegister(ILI9341_SPI, datas, nb_to_read);
	ILI9341_CS_SET();
}

/**
 * @brief  Dessine un seul pixel aux coordonnées souhaitées
 * @param  x: coordonnée X du pixel
 * @param  y: coordonnée Y du pixel
 * @param  color: couleur du pixel
 */
void ILI9341_DrawPixel(uint16_t x, uint16_t y, uint16_t color) {
	ILI9341_SetCursorPosition(x, y, x, y);

