yasserabdoulaye92/Projet_DEEP/drivers/bsp/tft_ili9341/stm32g4_ili9341.c
	ILI9341_SendCommand(ILI9341_GRAM);
	ILI9341_SendData(color >> 8);
	ILI9341_SendData(color & 0xFF);
}

uint16_t ILI9341_ReadPixel(int16_t x, int16_t y)
{
    uint8_t block[400] = {0};
    ILI9341_SetCursorPosition(x, y, x, y);
    ILI9341_ReadDatas(ILI9341_CMD_MEMORY_READ, block, (uint8_t)400);
    return ((block[1] & 0xF8) << 8u) | ((block[2] & 0xFC) << 3u) | (block[3] >> 3u);
}

/**
 * @brief  Utilisée pour sélectionner une zone où le curseur dessinera une couleur sur l'écran.
 * @param  x1: Coordonnée X du coin supérieur gauche de la zone
 * @param  y1: Coordonnée Y du coin supérieur gauche de la zone
 * @param  x2: Coordonnée X du coin inférieur droit de la zone
 * @param  y2: Coordonnée Y du coin inférieur droit de la zone
 */
void ILI9341_SetCursorPosition(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2) {
	ILI9341_SendCommand(ILI9341_COLUMN_ADDR);
	ILI9341_SendData(x1 >> 8);
	ILI9341_SendData(x1 & 0xFF);
	ILI9341_SendData(x2 >> 8);
	ILI9341_SendData(x2 & 0xFF);

	ILI9341_SendCommand(ILI9341_PAGE_ADDR);
	ILI9341_SendData(y1 >> 8);
	ILI9341_SendData(y1 & 0xFF);
	ILI9341_SendData(y2 >> 8);
	ILI9341_SendData(y2 & 0xFF);
}

/**
 * @brief  Remplit l'intégralité de l'écran LCD avec une couleur
 * @param  color: Couleur à utiliser pour le remplissage
 */
void ILI9341_Fill(uint16_t color) {
	/* Fill entire screen */
	ILI9341_INT_Fill(0, 0, ILI9341_Opts.width - 1, ILI9341_Opts.height, color);
}

/**
 * @brief  Remplit une zone choisie avec une couleur
 * @param  x0: Coordonnée X du point supérieur gauche
 * @param  y0: Coordonnée Y du point supérieur gauche
 * @param  x1: Coordonnée X du point inférieur droit
 * @param  y1: Coordonnée Y du point inférieur droit
 * @param  color: Couleur à utiliser pour le remplissage
 */
void ILI9341_INT_Fill(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t color) {
	uint32_t pixels_count;
	uint8_t datas[2];
	datas[1] = HIGHINT(color);
	datas[0] = LOWINT(color);

	/* Set cursor position */
	ILI9341_SetCursorPosition(x0, y0, x1, y1);

	/* Set command for GRAM data */
	ILI9341_SendCommand(ILI9341_GRAM);
	
	/* Calculate pixels count */
	pixels_count = (x1 - x0 + 1) * (y1 - y0 + 1);

	/* Send everything */
	ILI9341_CS_RESET();

	ILI9341_WRX_SET();

	/* Go to 16-bit SPI mode */
#if !CUSTOM_FAST_MODE
	BSP_SPI_SetDataSize(ILI9341_SPI, SPI_DATASIZE_16BIT);
#endif
	uint32_t i;
	for(i=0;i<pixels_count;i++)
	{
		//16-bit mode
		//BSP_SPI_WriteMultiNoRegister(ILI9341_SPI, datas, 1);

		//8-bit mode
		//BSP_SPI_WriteMultiNoRegister(ILI9341_SPI, &datas[1], 1);
		//BSP_SPI_WriteMultiNoRegister(ILI9341_SPI, &datas[0], 1);


		//custom 8-bit mode to avoid function call overhead
#if CUSTOM_FAST_MODE
		__unused uint8_t tmpreg8;
		while ((ILI9341_SPI->SR & SPI_FLAG_FTLVL) != SPI_FTLVL_EMPTY);
		while ((ILI9341_SPI->SR & SPI_FLAG_BSY) != RESET);
		tmpreg8 = ILI9341_SPI->DR;
		tmpreg8 = ILI9341_SPI->SR;
		*((__IO uint8_t *)&ILI9341_SPI->DR) = (datas[1]);

		while ((ILI9341_SPI->SR & SPI_FLAG_FTLVL) != SPI_FTLVL_EMPTY);
		while ((ILI9341_SPI->SR & SPI_FLAG_BSY) != RESET);
		tmpreg8 = ILI9341_SPI->DR;
		tmpreg8 = ILI9341_SPI->SR;
		*((__IO uint8_t *)&ILI9341_SPI->DR) = (datas[0]);
#else
		BSP_SPI_WriteMultiNoRegister(ILI9341_SPI, datas, 1);
#endif
	}

	ILI9341_CS_SET();

	/* Go back to 8-bit SPI mode */
#if !CUSTOM_FAST_MODE
	BSP_SPI_SetDataSize(ILI9341_SPI, SPI_DATASIZE_8BIT);
#endif
}

void ILI9341_Delay(volatile unsigned int delay) {
	for (; delay != 0; delay--); 
}

/**
 * @brief  Pivote l'écran LCD vers une orientation spécifique
 * @param  orientation: Orientation de l'écran LCD. Ce paramètre peut prendre une valeur de l'énumération @ref ILI9341_Orientation_t
 */
void ILI9341_Rotate(ILI9341_Orientation_t orientation) {
	ILI9341_SendCommand(ILI9341_MAC);

#if (ILI9341_WIDTH == 160)		//TFT 1.44"
		ILI9341_SendData(0x68);
		ILI9341_Opts.width = ILI9341_WIDTH;
		ILI9341_Opts.height = ILI9341_HEIGHT;
		ILI9341_Opts.orientation = ILI9341_Orientation_Portrait_1;
#else
	if (orientation == ILI9341_Orientation_Portrait_1) {
			ILI9341_SendData(0x58);
		} else if (orientation == ILI9341_Orientation_Portrait_2) {
			ILI9341_SendData(0x88);
		} else if (orientation == ILI9341_Orientation_Landscape_1) {
			ILI9341_SendData(0x28);
		} else if (orientation == ILI9341_Orientation_Landscape_2) {
			ILI9341_SendData(0xE8);
		}

	ILI9341_Opts.orientation = orientation;
	if (orientation == ILI9341_Orientation_Portrait_1 || orientation == ILI9341_Orientation_Portrait_2) {
		ILI9341_Opts.width = ILI9341_WIDTH;
		ILI9341_Opts.height = ILI9341_HEIGHT;
	} else {
		ILI9341_Opts.width = ILI9341_HEIGHT;
		ILI9341_Opts.height = ILI9341_WIDTH;
	}
#endif
}

/**
 * @brief  Affiche une chaîne de caractères sur l'écran LCD
 * @param  x: Position X du coin supérieur gauche du premier caractère de la chaîne
 * @param  y: Position Y du coin supérieur gauche du premier caractère de la chaîne
 * @param  *str: Pointeur vers le premier caractère de la chaîne
 * @param  *font: Pointeur vers la police utilisée @ref FontDef_t
 * @param  foreground: Couleur de la chaîne de caractères
 * @param  background: Couleur de fond de la chaîne de caractères
 */
void ILI9341_Puts(uint16_t x, uint16_t y, char *str, FontDef_t *font, uint16_t foreground, uint16_t background) {
	uint16_t startX = x;
	
	/* Set X and Y coordinates */
	ILI9341_x = x;
	ILI9341_y = y;
	
	while (*str) {
		/* New line */
		if (*str == '\n') {
			ILI9341_y += font->FontHeight + 1;
			/* if after \n is also \r, than go to the left of the screen */
			if (*(str + 1) == '\r') {
				ILI9341_x = 0;
				str++;
			} else {
				ILI9341_x = startX;
			}
			str++;
			continue;
		} else if (*str == '\r') {
			str++;
			continue;
		}
		if(ILI9341_x > ILI9341_Opts.width - font->FontWidth)
		{  
			//on passe � la ligne suivante, en s'alignant sous le d�but de la premi�re ligne
			ILI9341_y += font->FontHeight + 1;
			ILI9341_x = startX;
		}
		/* Put character to LCD */
		ILI9341_Putc(ILI9341_x, ILI9341_y, *str++, font, foreground, background);
	}
}


/**
 * @brief Permet l'affichage de "gros caractères" ('bigger' fois plus gros que la 'font' fournie)
 * @param x: Position X du coin supérieur gauche du premier caractère de la chaîne
 * @param y: Position Y du coin supérieur gauche du premier caractère de la chaîne
 * @param str: Pointeur vers le premier caractère de la chaîne
 * @param font: Pointeur vers la police utilisée @ref FontDef_t
 * @param foreground: Couleur de la chaîne de caractères
 * @param background: Couleur de fond de la chaîne de caractères
 * @param bigger: Facteur de grossissement des caractères
 * @param full_in_bigger: Définit le taux de remplissage des gros pixels générés
 * @pre full_in_bigger doit être inférieur ou égal à bigger.
 * @note Testez pour comprendre et apprécier le style !
 * @example
 *      ILI9341_PutBigs(20, 40, "tst4,3", &Font_16x26, ILI9341_COLOR_BLUE, ILI9341_COLOR_BLACK, 4, 3);
 *      ILI9341_PutBigs(20, 40, "test2,2", &Font_16x26, ILI9341_COLOR_BLUE, ILI9341_COLOR_BLACK, 2, 2);
 */
void ILI9341_PutBigs(uint16_t x, uint16_t y, char *str, FontDef_t *font, uint16_t foreground, uint16_t background, uint8_t bigger, uint8_t full_in_bigger) {
    uint16_t startX = x;

    /* Set X and Y coordinates */
    ILI9341_x = x;
    ILI9341_y = y;

    while (*str) {
        /* New line */
        if (*str == '\n') {
            ILI9341_y += font->FontHeight * bigger + bigger;
            /* if after \n is also \r, then go to the left of the screen */
            if (*(str + 1) == '\r') {
                ILI9341_x = 0;
                str++;
            } else {
                ILI9341_x = startX;
            }
            str++;
            continue;
        } else if (*str == '\r') {
            str++;
            continue;
        }
        if (ILI9341_x > ILI9341_Opts.width - font->FontWidth * bigger) {
            /* Go to the next line, aligned under the start of the first line */
            ILI9341_y += font->FontHeight * bigger + bigger;
            ILI9341_x = startX;
        }
        /* Put character to LCD */
        ILI9341_PutBigc(ILI9341_x, ILI9341_y, *str++, font, foreground, background, bigger, full_in_bigger);
    }
}


/**
 * @brief  Obtient la largeur et la hauteur d'une boîte avec du texte
 * @param  str: Pointeur vers le premier caractère
 * @param  font: Pointeur vers la police utilisée @ref FontDef_t
 * @param  width: Pointeur vers la variable pour stocker la largeur
 * @param  height: Pointeur vers la variable pour stocker la hauteur
 */
void ILI9341_GetStringSize(char *str, FontDef_t *font, uint16_t *width, uint16_t *height) {
	uint16_t w = 0;
	*height = font->FontHeight;
	while (*str++) {
		w += font->FontWidth;
	}
	*width = w;
}

/**
 * @brief  Affiche un seul caractère sur l'écran LCD
 * @param  x: Position X du coin supérieur gauche
 * @param  y: Position Y du coin supérieur gauche
 * @param  c: Caractère à afficher
 * @param  font: Pointeur vers la police utilisée @ref FontDef_t
 * @param  foreground: Couleur du caractère
 * @param  background: Couleur de fond du caractère
 */
void ILI9341_Putc(uint16_t x, uint16_t y, char c, FontDef_t *font, uint16_t foreground, uint16_t background) {
	uint32_t i, b, j;
	/* Set coordinates */
	ILI9341_x = x;
	ILI9341_y = y;
	
