yasserabdoulaye92/Projet_DEEP/drivers/bsp/tft_ili9341/stm32g4_ili9341.c
	if ((ILI9341_x + font->FontWidth) > ILI9341_Opts.width) {
		/* If at the end of a line of display, go to new line and set x to 0 position */
		ILI9341_y += font->FontHeight;
		ILI9341_x = 0;
	}
	
	/* Draw rectangle for background */
	ILI9341_INT_Fill(ILI9341_x, ILI9341_y, ILI9341_x + font->FontWidth, ILI9341_y + font->FontHeight, background);
	

	/* Draw font data */
	for (i = 0; i < font->FontHeight; i++) {


		if(font->datasize == 1)
		{
			uint8_t * data;
			data = (uint8_t *)font->data;
			b = (uint32_t)(data[(c - 32) * font->FontHeight + i]) << 8;
		}
		else if(font->datasize == 2)
		{
			uint16_t * data;
			data = (uint16_t *)font->data;
			b = data[(c - 32) * font->FontHeight + i];
		}
		else
			b = 0;	//should never happen
		for (j = 0; j < font->FontWidth; j++) {
			if ((b << j) & 0x8000) {
				ILI9341_DrawPixel(ILI9341_x + j, (ILI9341_y + i), foreground);
			}
		}
	}
	
	/* Set new pointer */
	ILI9341_x += font->FontWidth;
}


/**
 * @brief  Affiche un caractère agrandi sur l'écran LCD
 * @param  x: Position X du coin supérieur gauche
 * @param  y: Position Y du coin supérieur gauche
 * @param  c: Caractère à afficher
 * @param  font: Pointeur vers la police utilisée @ref FontDef_t
 * @param  foreground: Couleur du caractère
 * @param  background: Couleur de fond du caractère
 * @param  bigger: Amplification de la taille du caractère
 * @param  full_in_bigger: Sorte de "pourcentage de remplissage" : mettre la même valeur que bigger ou moins (essayez pour voir si cela vous plaît)
 */
void ILI9341_PutBigc(uint16_t x, uint16_t y, char c, FontDef_t *font, uint16_t foreground, uint16_t background, uint8_t bigger, uint8_t full_in_bigger) {
	uint32_t i, b, j;
	/* Set coordinates */
	ILI9341_x = x;
	ILI9341_y = y;

	if ((ILI9341_x + font->FontWidth) > ILI9341_Opts.width) {
		/* If at the end of a line of display, go to new line and set x to 0 position */
		ILI9341_y += font->FontHeight;
		ILI9341_x = 0;
	}

	/* Draw rectangle for background */
	ILI9341_INT_Fill(ILI9341_x, ILI9341_y, ILI9341_x + bigger*font->FontWidth, ILI9341_y + bigger*font->FontHeight, background);


	/* Draw font data */
	for (i = 0; i < font->FontHeight; i++) {


		if(font->datasize == 1)
		{
			uint8_t * data;
			data = (uint8_t *)font->data;
			b = (uint32_t)(data[(c - 32) * font->FontHeight + i]) << 8;
		}
		else if(font->datasize == 2)
		{
			uint16_t * data;
			data = (uint16_t *)font->data;
			b = data[(c - 32) * font->FontHeight + i];
		}
		else
			b = 0;	//should never happen

		for (j = 0; j < font->FontWidth; j++)
		{
			if ((b << j) & 0x8000)
			{
				uint32_t k, l;

				for(k=0;k<full_in_bigger;k++)
					for(l=0;l<full_in_bigger;l++)
						ILI9341_DrawPixel(ILI9341_x + bigger*j+l, (ILI9341_y + bigger*i+k), foreground);
			}
		}
	}

	/* Set new pointer */
	ILI9341_x += font->FontWidth*bigger;
}


/**
 * @brief  Dessine une ligne sur l'écran LCD
 * @param  x0: Coordonnée X du point de départ
 * @param  y0: Coordonnée Y du point de départ
 * @param  x1: Coordonnée X du point d'arrivée
 * @param  y1: Coordonnée Y du point d'arrivée
 * @param  color: Couleur de la ligne
 */
void ILI9341_DrawLine(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t color)
{
    //WindowMax();
    int   dx = 0, dy = 0;
    int   dx_sym = 0, dy_sym = 0;
    int   dx_x2 = 0, dy_x2 = 0;
    int   di = 0;


    dx = x1-x0;
    dy = y1-y0;

    if (dx == 0) {        /* vertical line */
        if (y1 > y0) ILI9341_INT_Fill(x0, y0, x0, y1, color);
        else ILI9341_INT_Fill(x0, y1, x0, y0, color);
        return;
    }

    if (dx > 0) {
        dx_sym = 1;
    } else {
        dx_sym = -1;
    }
    if (dy == 0) {        /* horizontal line */
        if (x1 > x0) ILI9341_INT_Fill(x0, y0, x1, y0, color);
        else  ILI9341_INT_Fill(x1, y0, x0, y0, color);
        return;
    }

    if (dy > 0) {
        dy_sym = 1;
    } else {
        dy_sym = -1;
    }

    dx = dx_sym*dx;
    dy = dy_sym*dy;

    dx_x2 = dx*2;
    dy_x2 = dy*2;

    if (dx >= dy) {
        di = dy_x2 - dx;
        while (x0 != x1) {

        	ILI9341_DrawPixel(x0, y0, color);
            x0 += dx_sym;
            if (di<0) {
                di += dy_x2;
            } else {
                di += dy_x2 - dx_x2;
                y0 += dy_sym;
            }
        }
        ILI9341_DrawPixel(x0, y0, color);
    } else {
        di = dx_x2 - dy;
        while (y0 != y1) {
        	ILI9341_DrawPixel(x0, y0, color);
            y0 += dy_sym;
            if (di < 0) {
                di += dx_x2;
            } else {
                di += dx_x2 - dy_x2;
                x0 += dx_sym;
            }
        }
        ILI9341_DrawPixel(x0, y0, color);
    }
    return;
}

/**
 * @brief  Dessine un rectangle sur l'écran LCD
 * @param  x0: Coordonnée X du point supérieur gauche
 * @param  y0: Coordonnée Y du point supérieur gauche
 * @param  x1: Coordonnée X du point inférieur droit
 * @param  y1: Coordonnée Y du point inférieur droit
 * @param  color: Couleur du rectangle
 */
void ILI9341_DrawRectangle(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t color) {
	ILI9341_DrawLine(x0, y0, x1, y0, color); //Top
	ILI9341_DrawLine(x0, y0, x0, y1, color);	//Left
	ILI9341_DrawLine(x1, y0, x1, y1, color);	//Right
	ILI9341_DrawLine(x0, y1, x1, y1, color);	//Bottom
}

/**
 * @brief  Dessine un rectangle rempli sur l'écran LCD
 * @param  x0: Coordonnée X du point supérieur gauche
 * @param  y0: Coordonnée Y du point supérieur gauche
 * @param  x1: Coordonnée X du point inférieur droit
 * @param  y1: Coordonnée Y du point inférieur droit
 * @param  color: Couleur du rectangle
 */
void ILI9341_DrawFilledRectangle(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t color) {
	uint16_t tmp;
	
	/* Check correction */
	if (x0 > x1) {
		tmp = x0;
		x0 = x1;
		x1 = tmp;
	}
	if (y0 > y1) {
		tmp = y0;
		y0 = y1;
		y1 = tmp;
	}
	
	/* Fill rectangle */
	ILI9341_INT_Fill(x0, y0, x1, y1, color);
	
	/* CS HIGH back */
	ILI9341_CS_SET();
}

/**
 * @brief  Dessine un cercle sur l'écran LCD
 * @param  x0: Coordonnée X du centre du cercle
 * @param  y0: Coordonnée Y du centre du cercle
 * @param  r: Rayon du cercle
 * @param  color: Couleur du cercle
 */
void ILI9341_DrawCircle(int16_t x0, int16_t y0, int16_t r, uint16_t color) {
	int16_t f = 1 - r;
	int16_t ddF_x = 1;
	int16_t ddF_y = -2 * r;
	int16_t x = 0;
	int16_t y = r;

    ILI9341_DrawPixel(x0, y0 + r, color);
    ILI9341_DrawPixel(x0, y0 - r, color);
    ILI9341_DrawPixel(x0 + r, y0, color);
    ILI9341_DrawPixel(x0 - r, y0, color);

