yasserabdoulaye92/Projet_DEEP/drivers/bsp/tft_ili9341/stm32g4_ili9341.c
    while (x < y) {
        if (f >= 0) {
            y--;
            ddF_y += 2;
            f += ddF_y;
        }
        x++;
        ddF_x += 2;
        f += ddF_x;

        ILI9341_DrawPixel(x0 + x, y0 + y, color);
        ILI9341_DrawPixel(x0 - x, y0 + y, color);
        ILI9341_DrawPixel(x0 + x, y0 - y, color);
        ILI9341_DrawPixel(x0 - x, y0 - y, color);

        ILI9341_DrawPixel(x0 + y, y0 + x, color);
        ILI9341_DrawPixel(x0 - y, y0 + x, color);
        ILI9341_DrawPixel(x0 + y, y0 - x, color);
        ILI9341_DrawPixel(x0 - y, y0 - x, color);
    }
}

/**
 * @brief  Dessine un cercle rempli sur l'écran LCD
 * @param  x0: Coordonnée X du centre du cercle
 * @param  y0: Coordonnée Y du centre du cercle
 * @param  r: Rayon du cercle
 * @param  color: Couleur du cercle
 */
void ILI9341_DrawFilledCircle(int16_t x0, int16_t y0, int16_t r, uint16_t color) {
	int16_t f = 1 - r;
	int16_t ddF_x = 1;
	int16_t ddF_y = -2 * r;
	int16_t x = 0;
	int16_t y = r;

    ILI9341_DrawPixel(x0, y0 + r, color);
    ILI9341_DrawPixel(x0, y0 - r, color);
    ILI9341_DrawPixel(x0 + r, y0, color);
    ILI9341_DrawPixel(x0 - r, y0, color);
    ILI9341_DrawLine(x0 - r, y0, x0 + r, y0, color);

    while (x < y) {
        if (f >= 0) {
            y--;
            ddF_y += 2;
            f += ddF_y;
        }
        x++;
        ddF_x += 2;
        f += ddF_x;

        ILI9341_DrawLine(x0 - x, y0 + y, x0 + x, y0 + y, color);
        ILI9341_DrawLine(x0 + x, y0 - y, x0 - x, y0 - y, color);

        ILI9341_DrawLine(x0 + y, y0 + x, x0 - y, y0 + x, color);
        ILI9341_DrawLine(x0 + y, y0 - x, x0 - y, y0 - x, color);
    }
}

/**
 * @brief  Renvoie les options de l'ILI9341
 * @retval ILI9341_Opts : Options
 */
ILI931_Options_t ILI9341_getOptions(void){
	return ILI9341_Opts;
}

/**
 * @brief  Affiche une chaîne formatée sur l'écran LCD
 * @param  x: Position X du coin supérieur gauche du premier caractère de la chaîne
 * @param  y: Position Y du coin supérieur gauche du premier caractère de la chaîne
 * @param  *font: Pointeur vers la police de caractères utilisée
 * @param  foreground: Couleur de la chaîne
 * @param  background: Couleur de l'arrière-plan de la chaîne
 * @param  format : Chaîne formatée comme printf
 */
void ILI9341_printf(int16_t x, int16_t y, FontDef_t *font, int16_t foreground, int16_t background, const char *format, ...)
{
	char buffer[256];

	va_list args_list;
	va_start(args_list, format);
	vsnprintf(buffer, 256, format, args_list);
	va_end(args_list);

	ILI9341_Puts(x, y, buffer, font, foreground, background);
}

/**
 * @brief  Place une image sur l'écran LCD
 * @param  x0: Coordonnée X du point de départ
 * @param  y0: Coordonnée Y du point de départ
 * @param  width: Largeur de l'image
 * @param  height: Hauteur de l'image
 * @param  img: Pointeur vers le tableau de pixels de l'image en BMP 565
 * @param  size: Nombre d'éléments dans le tableau
 *
 * Astuce pour générer l'image :
 *  https://javl.github.io/image2cpp/
 *      Fournir une image en bmp
 *      Format de sortie du code : Plan bytes
 *      Mode de dessin : 2 bytes par pixel 565
 *
 *  /!\ Attention à la taille des images (la mémoire du microcontrôleur est vite remplie !!)
 */
void ILI9341_putImage(int16_t x0, int16_t y0, int16_t width, int16_t height, const int16_t *img, int32_t size){
	ILI9341_SetCursorPosition(x0, y0, x0 + width-1, y0 + height-1);

	uint8_t datas[2];

	/* Set command for GRAM data */
	ILI9341_SendCommand(ILI9341_GRAM);

	/* Send everything */
	ILI9341_CS_RESET();
	ILI9341_WRX_SET();

	/* Go to 16-bit SPI mode */
	BSP_SPI_SetDataSize(ILI9341_SPI, SPI_DATASIZE_16BIT);

#ifndef LCD_DMA
	int32_t i;
	for(i=0; i < size; i++){
		datas[1] = HIGHINT(img[i]);
		datas[0] = LOWINT(img[i]);
		BSP_SPI_WriteMultiNoRegister(ILI9341_SPI, datas, 1);
		//BSP_SPI_WriteNoRegister(ILI9341_SPI,0x07E0);
		//SPI_Write(img[i]);
	}
#else
	SPI2_DMA_send16BitArray((Uint16 *)img, size);
#endif


	BSP_SPI_SetDataSize(ILI9341_SPI, SPI_DATASIZE_8BIT);
	ILI9341_CS_SET();
}

#define TRANSPARENT_COLOR 0x07e0
void ILI9341_putImage_with_transparency(int16_t x0, int16_t y0, int16_t width, int16_t height, const int16_t *img_front, const int16_t * img_back, int32_t size){
	ILI9341_SetCursorPosition(x0, y0, x0 + width-1, y0 + height-1);

	uint8_t datas[2];

	/* Set command for GRAM data */
	ILI9341_SendCommand(ILI9341_GRAM);

	/* Send everything */
	ILI9341_CS_RESET();
	ILI9341_WRX_SET();

	/* Go to 16-bit SPI mode */
	BSP_SPI_SetDataSize(ILI9341_SPI, SPI_DATASIZE_16BIT);

	int32_t i;
	for(i=0; i < size; i++){
		if (img_front[i] == TRANSPARENT_COLOR)
		{
			datas[1] = HIGHINT(img_back[i]);
			datas[0] = LOWINT(img_back[i]);
		}
		else
		{
			datas[1] = HIGHINT(img_front[i]);
			datas[0] = LOWINT(img_front[i]);
		}
		BSP_SPI_WriteMultiNoRegister(ILI9341_SPI, datas, 1);
		//SPI_WriteNoRegister(ILI9341_SPI,0x07E0);
		//SPI_Write(img[i]);
	}

	BSP_SPI_SetDataSize(ILI9341_SPI, SPI_DATASIZE_8BIT);
	ILI9341_CS_SET();
}

#ifndef LCD_DMA
/**
 * @brief  Place une image monochrome sur l'écran LCD
 * @param  color_front: Couleur du pixel pour les bits à 1 (blanc)
 * @param  color_background: Couleur du pixel pour les bits à 0 (noir)
 * @param  x0: Coordonnée X du point de départ de l'image
 * @param  y0: Coordonnée Y du point de départ de l'image
 * @param  width: Largeur de l'image
 * @param  height: Hauteur de l'image
 * @param  img: Tableau contenant l'image monochrome
 * @param  size: Nombre d'octets dans le tableau d'image
 * @note La taille (width et height) de l'image doit être multiple de 8
 */
void ILI9341_putImage_monochrome(uint16_t color_front, uint16_t color_background, int16_t x0, int16_t y0, int16_t width, int16_t height, const uint8_t *img, int32_t size)
{
	ILI9341_SetCursorPosition(x0, y0, x0 + width-1, y0 + height-1);

	uint8_t datas_front[2];
	uint8_t datas_background[2];
	datas_front[1] = HIGHINT(color_front);
	datas_front[0] = LOWINT(color_front);
	datas_background[1] = HIGHINT(color_background);
	datas_background[0] = LOWINT(color_background);
	uint8_t * datas;
	/* Set command for GRAM data */
	ILI9341_SendCommand(ILI9341_GRAM);

	/* Send everything */
	ILI9341_CS_RESET();
	ILI9341_WRX_SET();

	/* Go to 16-bit SPI mode */
	BSP_SPI_SetDataSize(ILI9341_SPI, SPI_DATASIZE_16BIT);


	int32_t i;
	for(i=0; i < size; i++){
		if((img[i/8]>>(7-i%8))&1)	//Hooo, la belle ligne. Prenez 5mn pour comprendre ce qui est fait ici ^^
			datas = datas_background;
		else
			datas = datas_front;

		BSP_SPI_WriteMultiNoRegister(ILI9341_SPI, datas, 1);
	}

	BSP_SPI_SetDataSize(ILI9341_SPI, SPI_DATASIZE_8BIT);
}


void ILI9341_putImage_3bits(int16_t x0, int16_t y0, int16_t width, int16_t height, uint8_t *img, int32_t size, uint8_t scale)
{
	volatile __unused uint8_t tmpreg8;
	if(scale > 2 || scale < 1)
		return;
	ILI9341_SetCursorPosition(x0, y0, x0 + width-1, y0 + height-1);

