yasserabdoulaye92/Projet_DEEP/drivers/bsp/tft_ili9341/stm32g4_ili9341.c
	uint8_t datas[2];
	/* Set command for GRAM data */
	ILI9341_SendCommand(ILI9341_GRAM);

	/* Send everything */
	ILI9341_CS_RESET();
	ILI9341_WRX_SET();

	/* Go to 16-bit SPI mode */
//	BSP_SPI_SetDataSize(ILI9341_SPI, SPI_DATASIZE_16BIT);	//highint

	int32_t i, j=0, offset=0;
	uint8_t color3;

	if(scale == 2)
	{
		bool repeating_the_line = false;
		//cette fonction est peu lisible... mais elle est optimisée pour la vitesse d'exécution.
		//sans explication : bon courage pour la comprendre !
		for(i=0; i < size*scale; i++)
		{
			if(j==width)
			{
				if(repeating_the_line == false)
				{
					offset += width/2;
					repeating_the_line = true;
				}
				else
				{
					repeating_the_line = false;
				}
				j=0;
			}
			j++;
			j++;
			color3 = img[(i-offset)];

			/*cette approche bourrine est rentable en temps : 3 fois plus rapide !!!*/
#if CUSTOM_FAST_MODE
		//1er pixels, on envoit les 2 octets
			datas[1]  = (color3 & 0b100)?0b11111000:0;
			datas[1] |= (color3 & 0b010)?0b00000111:0;

			while ((ILI9341_SPI->SR & SPI_FLAG_FTLVL) != SPI_FTLVL_EMPTY);
			while ((ILI9341_SPI->SR & SPI_FLAG_BSY) != RESET);
			tmpreg8 = ILI9341_SPI->DR;
			tmpreg8 = ILI9341_SPI->SR;
			*((__IO uint8_t *)&ILI9341_SPI->DR) = (datas[1]);

			datas[0]  = (color3 & 0b010)?0b11100000:0;
			datas[0] |= (color3 & 0b001)?0b00011111:0;

			while ((ILI9341_SPI->SR & SPI_FLAG_FTLVL) != SPI_FTLVL_EMPTY);
			while ((ILI9341_SPI->SR & SPI_FLAG_BSY) != RESET);
			tmpreg8 = ILI9341_SPI->DR;
			tmpreg8 = ILI9341_SPI->SR;
			*((__IO uint8_t *)&ILI9341_SPI->DR) = (datas[0]);

			while ((ILI9341_SPI->SR & SPI_FLAG_FTLVL) != SPI_FTLVL_EMPTY);
			while ((ILI9341_SPI->SR & SPI_FLAG_BSY) != RESET);
			tmpreg8 = ILI9341_SPI->DR;
			tmpreg8 = ILI9341_SPI->SR;
			*((__IO uint8_t *)&ILI9341_SPI->DR) = (datas[1]);

			while ((ILI9341_SPI->SR & SPI_FLAG_FTLVL) != SPI_FTLVL_EMPTY);
			while ((ILI9341_SPI->SR & SPI_FLAG_BSY) != RESET);
			tmpreg8 = ILI9341_SPI->DR;
			tmpreg8 = ILI9341_SPI->SR;
			*((__IO uint8_t *)&ILI9341_SPI->DR) = (datas[0]);

#else
			BSP_SPI_WriteMultiNoRegister(ILI9341_SPI, &datas[1], 1);
			BSP_SPI_WriteMultiNoRegister(ILI9341_SPI, &datas[0], 1);
			BSP_SPI_WriteMultiNoRegister(ILI9341_SPI, &datas[1], 1);
			BSP_SPI_WriteMultiNoRegister(ILI9341_SPI, &datas[0], 1);
#endif
		}
	}
	else
	{
		for(i=0; i < size; i++)
		{
			color3 = img[i];
			datas[1]  = (color3 & 0b100)?0b11111000:0;
			datas[1] |= (color3 & 0b010)?0b00000111:0;
			datas[0]  = (color3 & 0b010)?0b11100000:0;
			datas[0] |= (color3 & 0b001)?0b00011111:0;
			BSP_SPI_WriteMultiNoRegister(ILI9341_SPI, datas, 1);
		}
	}

	while ((ILI9341_SPI->SR & SPI_FLAG_FTLVL) != SPI_FTLVL_EMPTY);
	while ((ILI9341_SPI->SR & SPI_FLAG_BSY) != RESET);
	tmpreg8 = ILI9341_SPI->DR;
	tmpreg8 = ILI9341_SPI->SR;

	ILI9341_CS_SET();
	BSP_SPI_SetDataSize(ILI9341_SPI, SPI_DATASIZE_8BIT);
}
#endif	//ndef LCD_DMA
#endif  // USE_ILI9341

